SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/MGM26/Include/mgm260pb32vnn.h
/* Part number capabilities */
#define ACMP_PRESENT                                         /** ACMP is available in this part */
#define ACMP_COUNT                                        2  /** 2 ACMPs available  */
#define AMUXCP_PRESENT                                       /** AMUXCP is available in this part */
#define AMUXCP_COUNT                                      1  /** 1 AMUXCPs available  */
#define BURAM_PRESENT                                        /** BURAM is available in this part */
#define BURAM_COUNT                                       1  /** 1 BURAMs available  */
#define BURTC_PRESENT                                        /** BURTC is available in this part */
#define BURTC_COUNT                                       1  /** 1 BURTCs available  */
#define CMU_PRESENT                                          /** CMU is available in this part */
#define CMU_COUNT                                         1  /** 1 CMUs available  */
#define DCDC_PRESENT                                         /** DCDC is available in this part */
#define DCDC_COUNT                                        1  /** 1 DCDCs available  */
#define DMEM_PRESENT                                         /** DMEM is available in this part */
#define DMEM_COUNT                                        2  /** 2 DMEMs available  */
#define DPLL_PRESENT                                         /** DPLL is available in this part */
#define DPLL_COUNT                                        1  /** 1 DPLLs available  */
#define EMU_PRESENT                                          /** EMU is available in this part */
#define EMU_COUNT                                         1  /** 1 EMUs available  */
#define EUSART_PRESENT                                       /** EUSART is available in this part */
#define EUSART_COUNT                                      4  /** 4 EUSARTs available  */
#define FSRCO_PRESENT                                        /** FSRCO is available in this part */
#define FSRCO_COUNT                                       1  /** 1 FSRCOs available  */
#define GPCRC_PRESENT                                        /** GPCRC is available in this part */
#define GPCRC_COUNT                                       1  /** 1 GPCRCs available  */
#define GPIO_PRESENT                                         /** GPIO is available in this part */
#define GPIO_COUNT                                        1  /** 1 GPIOs available  */
#define HFRCO_PRESENT                                        /** HFRCO is available in this part */
#define HFRCO_COUNT                                       1  /** 1 HFRCOs available  */
#define HFRCOEM23_PRESENT                                    /** HFRCOEM23 is available in this part */
#define HFRCOEM23_COUNT                                   1  /** 1 HFRCOEM23s available  */
#define HFXO_PRESENT                                         /** HFXO is available in this part */
#define HFXO_COUNT                                        1  /** 1 HFXOs available  */
#define HOSTMAILBOX_PRESENT                                  /** HOSTMAILBOX is available in this part */
#define HOSTMAILBOX_COUNT                                 1  /** 1 HOSTMAILBOXs available  */
#define I2C_PRESENT                                          /** I2C is available in this part */
#define I2C_COUNT                                         4  /** 4 I2Cs available  */
#define IADC_PRESENT                                         /** IADC is available in this part */
#define IADC_COUNT                                        1  /** 1 IADCs available  */
#define ICACHE_PRESENT                                       /** ICACHE is available in this part */
#define ICACHE_COUNT                                      1  /** 1 ICACHEs available  */
#define KEYSCAN_PRESENT                                      /** KEYSCAN is available in this part */
#define KEYSCAN_COUNT                                     1  /** 1 KEYSCANs available  */
#define LCD_PRESENT                                          /** LCD is available in this part */
#define LCD_COUNT                                         1  /** 1 LCDs available  */
#define LCDRF_PRESENT                                        /** LCDRF is available in this part */
#define LCDRF_COUNT                                       1  /** 1 LCDRFs available  */
#define LDMA_PRESENT                                         /** LDMA is available in this part */
#define LDMA_COUNT                                        1  /** 1 LDMAs available  */
#define LDMAXBAR_PRESENT                                     /** LDMAXBAR is available in this part */
#define LDMAXBAR_COUNT                                    1  /** 1 LDMAXBARs available  */
#define LETIMER_PRESENT                                      /** LETIMER is available in this part */
#define LETIMER_COUNT                                     1  /** 1 LETIMERs available  */
#define LFRCO_PRESENT                                        /** LFRCO is available in this part */
#define LFRCO_COUNT                                       1  /** 1 LFRCOs available  */
#define LFXO_PRESENT                                         /** LFXO is available in this part */
#define LFXO_COUNT                                        1  /** 1 LFXOs available  */
#define MSC_PRESENT                                          /** MSC is available in this part */
#define MSC_COUNT                                         1  /** 1 MSCs available  */
#define PCNT_PRESENT                                         /** PCNT is available in this part */
#define PCNT_COUNT                                        1  /** 1 PCNTs available  */
#define PRS_PRESENT                                          /** PRS is available in this part */
#define PRS_COUNT                                         1  /** 1 PRSs available  */
#define RADIOAES_PRESENT                                     /** RADIOAES is available in this part */
#define RADIOAES_COUNT                                    1  /** 1 RADIOAESs available  */
#define SEMAILBOX_PRESENT                                    /** SEMAILBOX is available in this part */
#define SEMAILBOX_COUNT                                   1  /** 1 SEMAILBOXs available  */
#define SMU_PRESENT                                          /** SMU is available in this part */
#define SMU_COUNT                                         1  /** 1 SMUs available  */
#define SYSCFG_PRESENT                                       /** SYSCFG is available in this part */
#define SYSCFG_COUNT                                      1  /** 1 SYSCFGs available  */
#define SYSRTC_PRESENT                                       /** SYSRTC is available in this part */
#define SYSRTC_COUNT                                      1  /** 1 SYSRTCs available  */
#define TIMER_PRESENT                                        /** TIMER is available in this part */
#define TIMER_COUNT                                       10 /** 10 TIMERs available  */
#define ULFRCO_PRESENT                                       /** ULFRCO is available in this part */
#define ULFRCO_COUNT                                      1  /** 1 ULFRCOs available  */
#define USART_PRESENT                                        /** USART is available in this part */
#define USART_COUNT                                       3  /** 3 USARTs available  */
#define VDAC_PRESENT                                         /** VDAC is available in this part */
#define VDAC_COUNT                                        2  /** 2 VDACs available  */
#define WDOG_PRESENT                                         /** WDOG is available in this part */
#define WDOG_COUNT                                        2  /** 2 WDOGs available  */
#define DEVINFO_PRESENT                                      /** DEVINFO is available in this part */
#define DEVINFO_COUNT                                     1  /** 1 DEVINFOs available  */

/* Include standard ARM headers for the core */
#include "core_cm33.h"    /* Core Header File */
#include "system_mgm26.h" /* System Header File */

/** @} End of group MGM260PB32VNN_Part */

/**************************************************************************//**
 * @defgroup MGM260PB32VNN_Peripheral_TypeDefs MGM260PB32VNN Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 *****************************************************************************/
#include "mgm26_emu.h"
#include "mgm26_cmu.h"
#include "mgm26_burtc.h"
#include "mgm26_hfrco.h"
#include "mgm26_fsrco.h"
#include "mgm26_dpll.h"
#include "mgm26_lfxo.h"
#include "mgm26_lfrco.h"
#include "mgm26_ulfrco.h"
#include "mgm26_keyscan.h"
#include "mgm26_msc.h"
#include "mgm26_icache.h"
#include "mgm26_prs.h"
#include "mgm26_gpio.h"
#include "mgm26_ldma.h"
#include "mgm26_ldmaxbar.h"
#include "mgm26_timer.h"
#include "mgm26_mpahbram.h"
#include "mgm26_syscfg.h"
#include "mgm26_buram.h"
#include "mgm26_gpcrc.h"
#include "mgm26_eusart.h"
#include "mgm26_dcdc.h"
#include "mgm26_mailbox.h"
#include "mgm26_usart.h"
#include "mgm26_sysrtc.h"
#include "mgm26_i2c.h"
#include "mgm26_lcd.h"
#include "mgm26_lcdrf.h"
#include "mgm26_aes.h"
#include "mgm26_smu.h"
#include "mgm26_letimer.h"
#include "mgm26_iadc.h"
#include "mgm26_acmp.h"
#include "mgm26_amuxcp.h"
#include "mgm26_vdac.h"
#include "mgm26_pcnt.h"
#include "mgm26_hfxo.h"
#include "mgm26_wdog.h"
#include "mgm26_semailbox.h"
#include "mgm26_devinfo.h"

/* Custom headers for LDMAXBAR and PRS mappings */
#include "mgm26_prs_signals.h"
#include "mgm26_dma_descriptor.h"
#include "mgm26_ldmaxbar_defines.h"

/** @} End of group MGM260PB32VNN_Peripheral_TypeDefs  */

/**************************************************************************//**
 * @defgroup MGM260PB32VNN_Peripheral_Base MGM260PB32VNN Peripheral Memory Map
 * @{
 *****************************************************************************/

#define EMU_S_BASE                (0x40004000UL) /* EMU_S base address */
#define CMU_S_BASE                (0x40008000UL) /* CMU_S base address */
#define BURTC_S_BASE              (0x4000C000UL) /* BURTC_S base address */
#define HFRCO0_S_BASE             (0x40010000UL) /* HFRCO0_S base address */
#define FSRCO_S_BASE              (0x40018000UL) /* FSRCO_S base address */
#define DPLL0_S_BASE              (0x4001C000UL) /* DPLL0_S base address */
#define LFXO_S_BASE               (0x40020000UL) /* LFXO_S base address */
#define LFRCO_S_BASE              (0x40024000UL) /* LFRCO_S base address */
#define ULFRCO_S_BASE             (0x40028000UL) /* ULFRCO_S base address */
#define KEYSCAN_S_BASE            (0x4002C000UL) /* KEYSCAN_S base address */
#define MSC_S_BASE                (0x40030000UL) /* MSC_S base address */
#define ICACHE0_S_BASE            (0x40034000UL) /* ICACHE0_S base address */
#define PRS_S_BASE                (0x40038000UL) /* PRS_S base address */
#define GPIO_S_BASE               (0x4003C000UL) /* GPIO_S base address */
#define LDMA_S_BASE               (0x40040000UL) /* LDMA_S base address */
#define LDMAXBAR_S_BASE           (0x40044000UL) /* LDMAXBAR_S base address */
#define TIMER0_S_BASE             (0x40048000UL) /* TIMER0_S base address */
#define TIMER1_S_BASE             (0x4004C000UL) /* TIMER1_S base address */
#define TIMER2_S_BASE             (0x40050000UL) /* TIMER2_S base address */
#define TIMER3_S_BASE             (0x40054000UL) /* TIMER3_S base address */
#define TIMER4_S_BASE             (0x40058000UL) /* TIMER4_S base address */
#define TIMER5_S_BASE             (0x4005C000UL) /* TIMER5_S base address */
#define TIMER6_S_BASE             (0x40060000UL) /* TIMER6_S base address */
#define TIMER7_S_BASE             (0x40064000UL) /* TIMER7_S base address */
#define TIMER8_S_BASE             (0x40068000UL) /* TIMER8_S base address */
#define TIMER9_S_BASE             (0x4006C000UL) /* TIMER9_S base address */
#define DMEM0_S_BASE              (0x40074000UL) /* DMEM0_S base address */
#define DMEM1_S_BASE              (0x40078000UL) /* DMEM1_S base address */
#define SYSCFG_S_CFGNS_BASE       (0x4007C000UL) /* SYSCFG_S_CFGNS base address */
#define SYSCFG_S_BASE             (0x40080000UL) /* SYSCFG_S base address */
#define BURAM_S_BASE              (0x40084000UL) /* BURAM_S base address */
#define GPCRC_S_BASE              (0x40088000UL) /* GPCRC_S base address */
#define EUSART1_S_BASE            (0x4008C000UL) /* EUSART1_S base address */
#define EUSART2_S_BASE            (0x40090000UL) /* EUSART2_S base address */
#define EUSART3_S_BASE            (0x40094000UL) /* EUSART3_S base address */
#define DCDC_S_BASE               (0x40098000UL) /* DCDC_S base address */
#define HOSTMAILBOX_S_BASE        (0x4009C000UL) /* HOSTMAILBOX_S base address */
#define USART0_S_BASE             (0x400A0000UL) /* USART0_S base address */
#define USART1_S_BASE             (0x400A4000UL) /* USART1_S base address */
#define USART2_S_BASE             (0x400A8000UL) /* USART2_S base address */
#define SYSRTC0_S_BASE            (0x400AC000UL) /* SYSRTC0_S base address */
#define I2C1_S_BASE               (0x400B0000UL) /* I2C1_S base address */
#define I2C2_S_BASE               (0x400B4000UL) /* I2C2_S base address */
#define I2C3_S_BASE               (0x400B8000UL) /* I2C3_S base address */
#define LCD_S_BASE                (0x400BC000UL) /* LCD_S base address */
#define LCDRF_S_BASE              (0x400C0000UL) /* LCDRF_S base address */
#define RADIOAES_S_BASE           (0x44000000UL) /* RADIOAES_S base address */
#define SMU_S_BASE                (0x44008000UL) /* SMU_S base address */
#define SMU_S_CFGNS_BASE          (0x4400C000UL) /* SMU_S_CFGNS base address */
#define LETIMER0_S_BASE           (0x49000000UL) /* LETIMER0_S base address */
#define IADC0_S_BASE              (0x49004000UL) /* IADC0_S base address */
#define ACMP0_S_BASE              (0x49008000UL) /* ACMP0_S base address */
#define ACMP1_S_BASE              (0x4900C000UL) /* ACMP1_S base address */
#define AMUXCP0_S_BASE            (0x49020000UL) /* AMUXCP0_S base address */
#define VDAC0_S_BASE              (0x49024000UL) /* VDAC0_S base address */
#define VDAC1_S_BASE              (0x49028000UL) /* VDAC1_S base address */
#define PCNT0_S_BASE              (0x49030000UL) /* PCNT0_S base address */
#define HFRCOEM23_S_BASE          (0x4A000000UL) /* HFRCOEM23_S base address */
#define HFXO0_S_BASE              (0x4A004000UL) /* HFXO0_S base address */
#define I2C0_S_BASE               (0x4B000000UL) /* I2C0_S base address */
#define WDOG0_S_BASE              (0x4B004000UL) /* WDOG0_S base address */
#define WDOG1_S_BASE              (0x4B008000UL) /* WDOG1_S base address */
#define EUSART0_S_BASE            (0x4B010000UL) /* EUSART0_S base address */
#define SEMAILBOX_S_HOST_BASE     (0x4C000000UL) /* SEMAILBOX_S_HOST base address */
#define EMU_NS_BASE               (0x50004000UL) /* EMU_NS base address */
#define CMU_NS_BASE               (0x50008000UL) /* CMU_NS base address */
#define BURTC_NS_BASE             (0x5000C000UL) /* BURTC_NS base address */
#define HFRCO0_NS_BASE            (0x50010000UL) /* HFRCO0_NS base address */
#define FSRCO_NS_BASE             (0x50018000UL) /* FSRCO_NS base address */
#define DPLL0_NS_BASE             (0x5001C000UL) /* DPLL0_NS base address */
#define LFXO_NS_BASE              (0x50020000UL) /* LFXO_NS base address */
#define LFRCO_NS_BASE             (0x50024000UL) /* LFRCO_NS base address */
#define ULFRCO_NS_BASE            (0x50028000UL) /* ULFRCO_NS base address */
#define KEYSCAN_NS_BASE           (0x5002C000UL) /* KEYSCAN_NS base address */
#define MSC_NS_BASE               (0x50030000UL) /* MSC_NS base address */
#define ICACHE0_NS_BASE           (0x50034000UL) /* ICACHE0_NS base address */
#define PRS_NS_BASE               (0x50038000UL) /* PRS_NS base address */
#define GPIO_NS_BASE              (0x5003C000UL) /* GPIO_NS base address */
#define LDMA_NS_BASE              (0x50040000UL) /* LDMA_NS base address */
#define LDMAXBAR_NS_BASE          (0x50044000UL) /* LDMAXBAR_NS base address */
#define TIMER0_NS_BASE            (0x50048000UL) /* TIMER0_NS base address */
#define TIMER1_NS_BASE            (0x5004C000UL) /* TIMER1_NS base address */
#define TIMER2_NS_BASE            (0x50050000UL) /* TIMER2_NS base address */
#define TIMER3_NS_BASE            (0x50054000UL) /* TIMER3_NS base address */
#define TIMER4_NS_BASE            (0x50058000UL) /* TIMER4_NS base address */
#define TIMER5_NS_BASE            (0x5005C000UL) /* TIMER5_NS base address */
#define TIMER6_NS_BASE            (0x50060000UL) /* TIMER6_NS base address */
#define TIMER7_NS_BASE            (0x50064000UL) /* TIMER7_NS base address */
#define TIMER8_NS_BASE            (0x50068000UL) /* TIMER8_NS base address */
#define TIMER9_NS_BASE            (0x5006C000UL) /* TIMER9_NS base address */
#define DMEM0_NS_BASE             (0x50074000UL) /* DMEM0_NS base address */
#define DMEM1_NS_BASE             (0x50078000UL) /* DMEM1_NS base address */
#define SYSCFG_NS_CFGNS_BASE      (0x5007C000UL) /* SYSCFG_NS_CFGNS base address */
#define SYSCFG_NS_BASE            (0x50080000UL) /* SYSCFG_NS base address */
#define BURAM_NS_BASE             (0x50084000UL) /* BURAM_NS base address */
#define GPCRC_NS_BASE             (0x50088000UL) /* GPCRC_NS base address */
#define EUSART1_NS_BASE           (0x5008C000UL) /* EUSART1_NS base address */
#define EUSART2_NS_BASE           (0x50090000UL) /* EUSART2_NS base address */
#define EUSART3_NS_BASE           (0x50094000UL) /* EUSART3_NS base address */
#define DCDC_NS_BASE              (0x50098000UL) /* DCDC_NS base address */
#define HOSTMAILBOX_NS_BASE       (0x5009C000UL) /* HOSTMAILBOX_NS base address */
#define USART0_NS_BASE            (0x500A0000UL) /* USART0_NS base address */
#define USART1_NS_BASE            (0x500A4000UL) /* USART1_NS base address */
#define USART2_NS_BASE            (0x500A8000UL) /* USART2_NS base address */
#define SYSRTC0_NS_BASE           (0x500AC000UL) /* SYSRTC0_NS base address */
#define I2C1_NS_BASE              (0x500B0000UL) /* I2C1_NS base address */
#define I2C2_NS_BASE              (0x500B4000UL) /* I2C2_NS base address */
#define I2C3_NS_BASE              (0x500B8000UL) /* I2C3_NS base address */
#define LCD_NS_BASE               (0x500BC000UL) /* LCD_NS base address */
#define LCDRF_NS_BASE             (0x500C0000UL) /* LCDRF_NS base address */
#define RADIOAES_NS_BASE          (0x54000000UL) /* RADIOAES_NS base address */
#define SMU_NS_BASE               (0x54008000UL) /* SMU_NS base address */
#define SMU_NS_CFGNS_BASE         (0x5400C000UL) /* SMU_NS_CFGNS base address */
#define LETIMER0_NS_BASE          (0x59000000UL) /* LETIMER0_NS base address */
#define IADC0_NS_BASE             (0x59004000UL) /* IADC0_NS base address */
#define ACMP0_NS_BASE             (0x59008000UL) /* ACMP0_NS base address */
#define ACMP1_NS_BASE             (0x5900C000UL) /* ACMP1_NS base address */
#define AMUXCP0_NS_BASE           (0x59020000UL) /* AMUXCP0_NS base address */
#define VDAC0_NS_BASE             (0x59024000UL) /* VDAC0_NS base address */
#define VDAC1_NS_BASE             (0x59028000UL) /* VDAC1_NS base address */
#define PCNT0_NS_BASE             (0x59030000UL) /* PCNT0_NS base address */
#define HFRCOEM23_NS_BASE         (0x5A000000UL) /* HFRCOEM23_NS base address */
#define HFXO0_NS_BASE             (0x5A004000UL) /* HFXO0_NS base address */
#define I2C0_NS_BASE              (0x5B000000UL) /* I2C0_NS base address */
#define WDOG0_NS_BASE             (0x5B004000UL) /* WDOG0_NS base address */
#define WDOG1_NS_BASE             (0x5B008000UL) /* WDOG1_NS base address */
#define EUSART0_NS_BASE           (0x5B010000UL) /* EUSART0_NS base address */
#define SEMAILBOX_NS_HOST_BASE    (0x5C000000UL) /* SEMAILBOX_NS_HOST base address */

#if defined(SL_COMPONENT_CATALOG_PRESENT)
#include "sl_component_catalog.h"

#endif
#if defined(SL_CATALOG_TRUSTZONE_SECURE_CONFIG_PRESENT)
#include "sl_trustzone_secure_config.h"

#endif

